//COBOLGET JOB 1,NOTIFY=&SYSUID
//*COMPILE MODULES
//COMPILE      EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(MODULES),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(MODULES),DISP=SHR
//*COMPILE PROGRAM
//COMPILE      EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(TESTS),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(TESTS),DISP=SHR
//*LINK MODULES
//LKED.SYSLIB  DD DSNAME=CEE.SCEELKED,DISP=SHR
//             DD DSNAME=CEE.SCEELKEX,DISP=SHR
//             DD DSNAME=&SYSUID..LOAD,DISP=SHR
//LKED.SYSIN   DD *
  INCLUDE SYSLIB(MODULES)
// IF RC = 0 THEN
//*RUN PROGRAM
//RUN          EXEC PGM=TESTS
//STEPLIB      DD DSN=&SYSUID..LOAD,DISP=SHR
//PRTLINE      DD SYSOUT=*,OUTLIM=15000
//SYSOUT       DD SYSOUT=*,OUTLIM=15000
//CEEDUMP      DD DUMMY
//SYSUDUMP     DD DUMMY
// ELSE
// ENDIF